In [1]:
import pandas as pd
data = {'names':['Sara Moreno 34',
                 'jUAn GOMez 23',
                 'CArlos mArtinez 89',
                 'Alfredo VelaZques 3',
                 'luis Mora 56',
                 '@freddier #platzi 10',pd.NA]}

In [2]:
df = pd.DataFrame(data)
df

                  names
0        Sara Moreno 34
1         jUAn GOMez 23
2    CArlos mArtinez 89
3   Alfredo VelaZques 3
4          luis Mora 56
5  @freddier #platzi 10
6                  <NA>

In [3]:
df['names'].str.lower()

0          sara moreno 34
1           juan gomez 23
2      carlos martinez 89
3     alfredo velazques 3
4            luis mora 56
5    @freddier #platzi 10
6                    <NA>
Name: names, dtype: object

In [4]:
df['names'].str.upper()

0          SARA MORENO 34
1           JUAN GOMEZ 23
2      CARLOS MARTINEZ 89
3     ALFREDO VELAZQUES 3
4            LUIS MORA 56
5    @FREDDIER #PLATZI 10
6                    <NA>
Name: names, dtype: object

In [5]:
df['names'].str.capitalize()

0          Sara moreno 34
1           Juan gomez 23
2      Carlos martinez 89
3     Alfredo velazques 3
4            Luis mora 56
5    @freddier #platzi 10
6                    <NA>
Name: names, dtype: object

In [6]:
df['names'].str.len()

0      14
1      13
2      18
3      19
4      12
5      20
6    <NA>
Name: names, dtype: object

In [7]:
df['names'].str.split(' ')

0          [Sara, Moreno, 34]
1           [jUAn, GOMez, 23]
2      [CArlos, mArtinez, 89]
3     [Alfredo, VelaZques, 3]
4            [luis, Mora, 56]
5    [@freddier, #platzi, 10]
6                        <NA>
Name: names, dtype: object

In [8]:
#Para dividir el texto por espacios usamos split y definimos el carácter por
# el que queremos dividir, en este caso, un espacio vacío ' ' o '#':
df['names'].str.split('#') # Separar por # es un espacio vacio

0           [Sara Moreno 34]
1            [jUAn GOMez 23]
2       [CArlos mArtinez 89]
3      [Alfredo VelaZques 3]
4             [luis Mora 56]
5    [@freddier , platzi 10]
6                       <NA>
Name: names, dtype: object

In [9]:
# Para seleccionar los primeros o últimos 5 caracteres usamos:
df['names'].str[:5]

0    Sara
1    jUAn
2    CArlo
3    Alfre
4    luis
5    @fred
6     <NA>
Name: names, dtype: object

In [10]:
df['names'].str[-5:]

0    no 34
1    ez 23
2    ez 89
3    ues 3
4    ra 56
5    zi 10
6     <NA>
Name: names, dtype: object

In [12]:
#Podemos reemplazar una secuencia de caracteres por otra mediante:
df['names'].str.replace('Alfredo','Antonio')

0          Sara Moreno 34
1           jUAn GOMez 23
2      CArlos mArtinez 89
3     Antonio VelaZques 3
4            luis Mora 56
5    @freddier #platzi 10
6                    <NA>
Name: names, dtype: object

In [13]:
#También podemos buscar una secuencia de texto en específico, en este caso, 'ara':
df['names'].str.findall('ara')

0    [ara]
1       []
2       []
3       []
4       []
5       []
6     <NA>
Name: names, dtype: object

In [15]:
# También podemos crear un filtro basándonos en una secuencia de texto en específico, 
# en este caso, las filas que tengan 'or':
df['names'].str.contains('or')

0     True
1    False
2    False
3    False
4     True
5    False
6     <NA>
Name: names, dtype: object

In [16]:
# Así mismo, podemos contar el número de ocurrencias de un caracter en específico,
# por ejemplo, cuántas veces aparece la letra 'a':
df['names'].str.lower().str.count('a')

0       2
1       1
2       2
3       2
4       1
5       1
6    <NA>
Name: names, dtype: object

In [17]:
# Existen comandos más avanzados usando Regex, por ejemplo, 
# si quiero extraer los caracteres numéricos:
df['names'].str.extract('([0-9]+)', expand=False)

0      34
1      23
2      89
3       3
4      56
5      10
6    <NA>
Name: names, dtype: object

In [18]:
# si quiero extraer las menciones '@xxxx' del texto:
df['names'].str.replace('@[^\s]+','')

C:\Users\joel_\AppData\Local\Temp\ipykernel_11820\2971937205.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  df['names'].str.replace('@[^\s]+','')

0         Sara Moreno 34
1          jUAn GOMez 23
2     CArlos mArtinez 89
3    Alfredo VelaZques 3
4           luis Mora 56
5             #platzi 10
6                   <NA>
Name: names, dtype: object